# SF Salaries Exercise

** Import pandas as pd.**

In [ ]:
#to define pandes library
import pandas as pd

In [ ]:
#to define numpy library
import numpy as np

** Read Salaries.csv as a dataframe called sal.**

In [73]:
#insert csv file
df = pd.read_csv('Salaries.csv')

** Check the head of the DataFrame. **

In [74]:
# display the The first five rows of the data frame
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [75]:
# know basic info of data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [ ]:
# display colum names to using them
df.columns

**What is the average BasePay ?**

In [24]:
# #to select BasePay colums of data and calculate mean
df['BasePay'].mean()

66325.44884050643

** What is the highest amount of OvertimePay in the dataset ? **

In [25]:
# to display max overtime pay 
df['OvertimePay'].max()

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [79]:
# what is ID of JOSEPH DRISCOLL
# i try here to calculate Id of JOSEPH DRISCOLL 
name=df['EmployeeName']
for index in range(0,len(df)):
    for i in name :
        if i == 'JOSEPH DRISCOLL':
            print('JOSEPH DRISCOLL')

JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL
JOSEPH DRISCOLL

KeyboardInterrupt:

In [78]:
# to select value from data using name of raw (id) and name of colum('JobTitle')
df.loc[24,'JobTitle']

'CAPTAIN, FIRE SUPPRESSION'

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [40]:
# transpose data making row colum 
#df.transpose()
# adding all  value in id of JOSEPH DRISCOLL
#df[24].sum()
#calculate all pays of JOSEPH DRISCOLL
df.loc[24,'TotalPayBenefits']

270324.91

** What is the name of highest paid person (including benefits)?**

In [45]:
# Know the index of highest paid person
max= df['TotalPayBenefits'].argmax()

# find the highest paid person using Id and  EmployeeName
df.loc[max,'EmployeeName']

'NATHANIEL FORD'

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [49]:
# Know the index of lowest paid person
minn = df['TotalPayBenefits'].argmin()

# find the lowest paid person using Id and  EmployeeName
df.loc[minn,'EmployeeName']

#He is a bad person who did not receive any salary, but on the contrary, he has to pay a fine equal to 618.13

'Joe Lopez'

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [53]:
## To collect the data  that took place in the same year

years=df.groupby('Year')
years

# calculate the mean of BasePay
years['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

** How many unique job titles are there? **

In [58]:
# Arrange the values in the column JobTitle  and delete the duplicate
df['JobTitle'].nunique()

2159

** What are the top 5 most common jobs? **

In [64]:
# sort  all DataFrane according to sort 
top = df.sort_values(by='JobTitle') 
# display the The first five rows of the data frame
top.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
98074,98075,Phimy Truong,Youth Comm Advisor,52433.88,0.0,0.00,25297.50,52433.88,77731.38,2013,NaN,San Francisco,NaN
138458,138459,Phimy Truong,Youth Comm Advisor,32417.42,0.0,4048.49,15545.28,36465.91,52011.19,2014,NaN,San Francisco,NaN
103333,103334,Mario R Yedidia,Youth Comm Advisor,13915.80,0.0,5296.91,5744.53,19212.71,24957.24,2013,NaN,San Francisco,NaN
58842,58843,Mario Yedidia,Youth Comm Advisor,57544.73,0.0,0.00,28229.66,57544.73,85774.39,2012,NaN,San Francisco,NaN
18778,18779,MYRON SULAK,ZOO CURATOR,43148.00,0.0,23538.56,NaN,66686.56,66686.56,2011,NaN,San Francisco,NaN

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [67]:
# to grouped data according to Year 
#then counet The number of Job Titles and ather columes

df.groupby('Year').nunique()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Notes,Agency,Status
Year,,,,,,,,,,,,
2011,36159,33878,1045,27392,16300,22066,0,33962,33962,0,1,0
2012,36766,34349,1044,28078,16843,22579,36345,34662,36556,0,1,0
2013,37606,36150,1051,26979,16833,21868,31388,34998,35706,0,1,0
2014,38123,36684,997,28158,17918,22315,32684,35713,36383,0,1,0

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [84]:
# put the colum jop title in the variable job_title
job_title=df['JobTitle']
# convert colum into list 
list1=list(job_title)
# split each word in job title 
listt=job_title.split()
# intial counter to count no of word Chief
counter = 0
for i in range(0,len(listt)):
    if i == 'Chief':
        counter +=1
print('number of people have the word Chief in their job title =',counter )

AttributeError: 'Series' object has no attribute 'split'

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [ ]:
df.var()

# Great Job!